Autodesk.Revit.UI.UIApplication.#ctor(Autodesk.Revit.ApplicationServices.Application)
Use a database level Application to construct a UI-level Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL

Autodesk.Revit.UI.UIApplication
Represents an active session of the Autodesk Revit user interface, providing access to
UI customization methods, events, and the active document.
Remarks:
You can access documents from the database level Application object, obtained from
the Application property.  If you have an instance of the database level Application object,
you can construct a UIApplication from it.

Autodesk.Revit.UI.UIApplication.#ctor(Autodesk.Revit.ApplicationServices.ControlledApplication)
Use a database level Application to construct a UI-level Application.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL